app/views/users/show.html.erb

    <h2>Payments: </h2>
    <% if @user.payments.empty? %>
---
SELECT  1 AS one FROM "payments" WHERE "payments"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]