app/views/payments/_form.html.erb

    <%= form.label :recipient %>
     <%= form.collection_select :requester_id, (current_user.selected_users), :id, :full_name %>
---
SELECT "users".* FROM "users"