app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find(session[:user_id]) if logged_in?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]