app/controllers/payments_controller.rb

  def create
    @payment = current_user.payments.new(payment_params)

    if @payment.save
---
INSERT INTO "payments" ("payment_amount", "requester_id", "payer_id", "reason_for_payment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["payment_amount", 14.0], ["requester_id", 3], ["payer_id", 49], ["reason_for_payment", "Sg"], ["created_at", "2018-04-27 01:39:01.392020"], ["updated_at", "2018-04-27 01:39:01.392020"]]