app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Gizem"], ["last_name", "Dal"], ["email", "gizem@gmail.com"], ["created_at", "2018-04-27 03:34:46.093922"], ["updated_at", "2018-04-27 03:34:46.093922"]]