app/controllers/welcome_controller.rb

SELECT "payments".* FROM "payments" ORDER BY "payments"."created_at" DESC
---
  def index
    @payments = Payment.all