app/models/user.rb

SELECT "users".* FROM "users"
---
  def selected_users
    User.where.not(id: id)